I tested the following scenarios for removing topics.

---

Initial list of topics:

```hcl
topics = [
    {
      name       = "topic_0"
      partitions = 3
      config = {
        "cleanup.policy"  = "delete"
        "retention.ms"    = "86400000"
        "segment.bytes"   = "209715200"
        "retention.bytes" = "209715200"
      }
    },
    {
      name       = "topic_10"
      partitions = 3
      config = {
        "cleanup.policy"  = "delete"
        "retention.ms"    = "86400000"
        "segment.bytes"   = "209715200"
        "retention.bytes" = "209715200"
      }
    },
    {
      name       = "topic_15"
      partitions = 3
      config = {
        "cleanup.policy"  = "delete"
        "retention.ms"    = "86400000"
        "segment.bytes"   = "209715200"
        "retention.bytes" = "209715200"
      }
    },
    {
      name       = "topic_20"
      partitions = 3
      config = {
        "cleanup.policy"  = "delete"
        "retention.ms"    = "86400000"
        "segment.bytes"   = "209715200"
        "retention.bytes" = "209715200"
      }
    },
    {
      name       = "topic_25"
      partitions = 3
      config = {
        "cleanup.policy"  = "delete"
        "retention.ms"    = "86400000"
        "segment.bytes"   = "209715200"
        "retention.bytes" = "209715200"
      }
    }  ]
```

`terraform plan` output:
```
Terraform will perform the following actions:

  # module.event_streams.ibm_event_streams_topic.es_topic["topic_0"] will be created
  + resource "ibm_event_streams_topic" "es_topic" {
      + config               = {
          + "cleanup.policy"  = "delete"
          + "retention.bytes" = "209715200"
          + "retention.ms"    = "86400000"
          + "segment.bytes"   = "209715200"
        }
      + id                   = (known after apply)
      + kafka_brokers_sasl   = (known after apply)
      + kafka_http_url       = (known after apply)
      + name                 = "topic_0"
      + partitions           = 3
      + resource_instance_id = "crn:v1:bluemix:public:messagehub:us-south:a/26f737d77ed726547f77e08f865c5a26:4f645eda-a789-4408-a916-f9b25c04b8a3::"
    }

  # module.event_streams.ibm_event_streams_topic.es_topic["topic_10"] will be created
  + resource "ibm_event_streams_topic" "es_topic" {
      + config               = {
          + "cleanup.policy"  = "delete"
          + "retention.bytes" = "209715200"
          + "retention.ms"    = "86400000"
          + "segment.bytes"   = "209715200"
        }
      + id                   = (known after apply)
      + kafka_brokers_sasl   = (known after apply)
      + kafka_http_url       = (known after apply)
      + name                 = "topic_10"
      + partitions           = 3
      + resource_instance_id = "crn:v1:bluemix:public:messagehub:us-south:a/26f737d77ed726547f77e08f865c5a26:4f645eda-a789-4408-a916-f9b25c04b8a3::"
    }

  # module.event_streams.ibm_event_streams_topic.es_topic["topic_15"] will be created
  + resource "ibm_event_streams_topic" "es_topic" {
      + config               = {
          + "cleanup.policy"  = "delete"
          + "retention.bytes" = "209715200"
          + "retention.ms"    = "86400000"
          + "segment.bytes"   = "209715200"
        }
      + id                   = (known after apply)
      + kafka_brokers_sasl   = (known after apply)
      + kafka_http_url       = (known after apply)
      + name                 = "topic_15"
      + partitions           = 3
      + resource_instance_id = "crn:v1:bluemix:public:messagehub:us-south:a/26f737d77ed726547f77e08f865c5a26:4f645eda-a789-4408-a916-f9b25c04b8a3::"
    }

  # module.event_streams.ibm_event_streams_topic.es_topic["topic_20"] will be created
  + resource "ibm_event_streams_topic" "es_topic" {
      + config               = {
          + "cleanup.policy"  = "delete"
          + "retention.bytes" = "209715200"
          + "retention.ms"    = "86400000"
          + "segment.bytes"   = "209715200"
        }
      + id                   = (known after apply)
      + kafka_brokers_sasl   = (known after apply)
      + kafka_http_url       = (known after apply)
      + name                 = "topic_20"
      + partitions           = 3
      + resource_instance_id = "crn:v1:bluemix:public:messagehub:us-south:a/26f737d77ed726547f77e08f865c5a26:4f645eda-a789-4408-a916-f9b25c04b8a3::"
    }

  # module.event_streams.ibm_event_streams_topic.es_topic["topic_25"] will be created
  + resource "ibm_event_streams_topic" "es_topic" {
      + config               = {
          + "cleanup.policy"  = "delete"
          + "retention.bytes" = "209715200"
          + "retention.ms"    = "86400000"
          + "segment.bytes"   = "209715200"
        }
      + id                   = (known after apply)
      + kafka_brokers_sasl   = (known after apply)
      + kafka_http_url       = (known after apply)
      + name                 = "topic_25"
      + partitions           = 3
      + resource_instance_id = "crn:v1:bluemix:public:messagehub:us-south:a/26f737d77ed726547f77e08f865c5a26:4f645eda-a789-4408-a916-f9b25c04b8a3::"
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```

`terraform apply` output:
```
module.event_streams.ibm_event_streams_topic.es_topic["topic_0"]: Creating...
module.event_streams.ibm_event_streams_topic.es_topic["topic_10"]: Creating...
module.event_streams.ibm_event_streams_topic.es_topic["topic_25"]: Creating...
module.event_streams.ibm_event_streams_topic.es_topic["topic_15"]: Creating...
module.event_streams.ibm_event_streams_topic.es_topic["topic_20"]: Creating...
module.event_streams.ibm_event_streams_topic.es_topic["topic_20"]: Creation complete after 2s [id=crn:v1:bluemix:public:messagehub:us-south:a/26f737d77ed726547f77e08f865c5a26:4f645eda-a789-4408-a916-f9b25c04b8a3:topic:topic_20]
module.event_streams.ibm_event_streams_topic.es_topic["topic_10"]: Creation complete after 2s [id=crn:v1:bluemix:public:messagehub:us-south:a/26f737d77ed726547f77e08f865c5a26:4f645eda-a789-4408-a916-f9b25c04b8a3:topic:topic_10]
module.event_streams.ibm_event_streams_topic.es_topic["topic_25"]: Creation complete after 3s [id=crn:v1:bluemix:public:messagehub:us-south:a/26f737d77ed726547f77e08f865c5a26:4f645eda-a789-4408-a916-f9b25c04b8a3:topic:topic_25]
module.event_streams.ibm_event_streams_topic.es_topic["topic_15"]: Creation complete after 3s [id=crn:v1:bluemix:public:messagehub:us-south:a/26f737d77ed726547f77e08f865c5a26:4f645eda-a789-4408-a916-f9b25c04b8a3:topic:topic_15]
module.event_streams.ibm_event_streams_topic.es_topic["topic_0"]: Creation complete after 3s [id=crn:v1:bluemix:public:messagehub:us-south:a/26f737d77ed726547f77e08f865c5a26:4f645eda-a789-4408-a916-f9b25c04b8a3:topic:topic_0]
```

---

Removing a topic from the beginning of the list:
```hcl
topics = [
    {
      name       = "topic_10"
      partitions = 3
      config = {
        "cleanup.policy"  = "delete"
        "retention.ms"    = "86400000"
        "segment.bytes"   = "209715200"
        "retention.bytes" = "209715200"
      }
    },
    {
      name       = "topic_15"
      partitions = 3
      config = {
        "cleanup.policy"  = "delete"
        "retention.ms"    = "86400000"
        "segment.bytes"   = "209715200"
        "retention.bytes" = "209715200"
      }
    },
    {
      name       = "topic_20"
      partitions = 3
      config = {
        "cleanup.policy"  = "delete"
        "retention.ms"    = "86400000"
        "segment.bytes"   = "209715200"
        "retention.bytes" = "209715200"
      }
    },
    {
      name       = "topic_25"
      partitions = 3
      config = {
        "cleanup.policy"  = "delete"
        "retention.ms"    = "86400000"
        "segment.bytes"   = "209715200"
        "retention.bytes" = "209715200"
      }
    }
  ]
```

`terraform plan` output:
```
Terraform will perform the following actions:

  # module.event_streams.ibm_event_streams_topic.es_topic["topic_0"] will be destroyed
  # (because key ["topic_0"] is not in for_each map)
  - resource "ibm_event_streams_topic" "es_topic" {
      - config               = {
          - "cleanup.policy"  = "delete"
          - "retention.bytes" = "209715200"
          - "retention.ms"    = "86400000"
          - "segment.bytes"   = "209715200"
        } -> null
      - id                   = "crn:v1:bluemix:public:messagehub:us-south:a/26f737d77ed726547f77e08f865c5a26:4f645eda-a789-4408-a916-f9b25c04b8a3:topic:topic_0" -> null
      - kafka_brokers_sasl   = [
          - "broker-0-kpgqq4h27t2jjby7.kafka.svc11.us-south.eventstreams.cloud.ibm.com:9093",
          - "broker-1-kpgqq4h27t2jjby7.kafka.svc11.us-south.eventstreams.cloud.ibm.com:9093",
          - "broker-2-kpgqq4h27t2jjby7.kafka.svc11.us-south.eventstreams.cloud.ibm.com:9093",
          - "broker-3-kpgqq4h27t2jjby7.kafka.svc11.us-south.eventstreams.cloud.ibm.com:9093",
          - "broker-4-kpgqq4h27t2jjby7.kafka.svc11.us-south.eventstreams.cloud.ibm.com:9093",
          - "broker-5-kpgqq4h27t2jjby7.kafka.svc11.us-south.eventstreams.cloud.ibm.com:9093",
        ] -> null
      - kafka_http_url       = "https://kpgqq4h27t2jjby7.svc11.us-south.eventstreams.cloud.ibm.com" -> null
      - name                 = "topic_0" -> null
      - partitions           = 3 -> null
      - resource_instance_id = "crn:v1:bluemix:public:messagehub:us-south:a/26f737d77ed726547f77e08f865c5a26:4f645eda-a789-4408-a916-f9b25c04b8a3::" -> null
    }

Plan: 0 to add, 0 to change, 1 to destroy.
```

`terraform apply` output:
```
module.event_streams.ibm_event_streams_topic.es_topic["topic_0"]: Destroying... [id=crn:v1:bluemix:public:messagehub:us-south:a/26f737d77ed726547f77e08f865c5a26:4f645eda-a789-4408-a916-f9b25c04b8a3:topic:topic_0]
module.event_streams.ibm_event_streams_topic.es_topic["topic_0"]: Destruction complete after 1s
```

---

Removing a topic from the middle of the list:
```hcl
topics = [
    {
      name       = "topic_10"
      partitions = 3
      config = {
        "cleanup.policy"  = "delete"
        "retention.ms"    = "86400000"
        "segment.bytes"   = "209715200"
        "retention.bytes" = "209715200"
      }
    },
    {
      name       = "topic_20"
      partitions = 3
      config = {
        "cleanup.policy"  = "delete"
        "retention.ms"    = "86400000"
        "segment.bytes"   = "209715200"
        "retention.bytes" = "209715200"
      }
    },
    {
      name       = "topic_25"
      partitions = 3
      config = {
        "cleanup.policy"  = "delete"
        "retention.ms"    = "86400000"
        "segment.bytes"   = "209715200"
        "retention.bytes" = "209715200"
      }
    }
  ]
```

`terraform plan` output:
```
Terraform will perform the following actions:

  # module.event_streams.ibm_event_streams_topic.es_topic["topic_15"] will be destroyed
  # (because key ["topic_15"] is not in for_each map)
  - resource "ibm_event_streams_topic" "es_topic" {
      - config               = {
          - "cleanup.policy"  = "delete"
          - "retention.bytes" = "209715200"
          - "retention.ms"    = "86400000"
          - "segment.bytes"   = "209715200"
        } -> null
      - id                   = "crn:v1:bluemix:public:messagehub:us-south:a/26f737d77ed726547f77e08f865c5a26:4f645eda-a789-4408-a916-f9b25c04b8a3:topic:topic_15" -> null
      - kafka_brokers_sasl   = [
          - "broker-0-kpgqq4h27t2jjby7.kafka.svc11.us-south.eventstreams.cloud.ibm.com:9093",
          - "broker-1-kpgqq4h27t2jjby7.kafka.svc11.us-south.eventstreams.cloud.ibm.com:9093",
          - "broker-2-kpgqq4h27t2jjby7.kafka.svc11.us-south.eventstreams.cloud.ibm.com:9093",
          - "broker-3-kpgqq4h27t2jjby7.kafka.svc11.us-south.eventstreams.cloud.ibm.com:9093",
          - "broker-4-kpgqq4h27t2jjby7.kafka.svc11.us-south.eventstreams.cloud.ibm.com:9093",
          - "broker-5-kpgqq4h27t2jjby7.kafka.svc11.us-south.eventstreams.cloud.ibm.com:9093",
        ] -> null
      - kafka_http_url       = "https://kpgqq4h27t2jjby7.svc11.us-south.eventstreams.cloud.ibm.com" -> null
      - name                 = "topic_15" -> null
      - partitions           = 3 -> null
      - resource_instance_id = "crn:v1:bluemix:public:messagehub:us-south:a/26f737d77ed726547f77e08f865c5a26:4f645eda-a789-4408-a916-f9b25c04b8a3::" -> null
    }

Plan: 0 to add, 0 to change, 1 to destroy.
```

`terraform apply` output:
```
module.event_streams.ibm_event_streams_topic.es_topic["topic_15"]: Destroying... [id=crn:v1:bluemix:public:messagehub:us-south:a/26f737d77ed726547f77e08f865c5a26:4f645eda-a789-4408-a916-f9b25c04b8a3:topic:topic_15]
module.event_streams.ibm_event_streams_topic.es_topic["topic_15"]: Destruction complete after 1s
```

---

Removing a topic from the end of the list:
```hcl
topics = [
    {
      name       = "topic_10"
      partitions = 3
      config = {
        "cleanup.policy"  = "delete"
        "retention.ms"    = "86400000"
        "segment.bytes"   = "209715200"
        "retention.bytes" = "209715200"
      }
    },
    {
      name       = "topic_20"
      partitions = 3
      config = {
        "cleanup.policy"  = "delete"
        "retention.ms"    = "86400000"
        "segment.bytes"   = "209715200"
        "retention.bytes" = "209715200"
      }
    },
    {
      name       = "topic_25"
      partitions = 3
      config = {
        "cleanup.policy"  = "delete"
        "retention.ms"    = "86400000"
        "segment.bytes"   = "209715200"
        "retention.bytes" = "209715200"
      }
    }
  ]
```

`terraform plan` output:
```
Terraform will perform the following actions:

  # module.event_streams.ibm_event_streams_topic.es_topic["topic_25"] will be destroyed
  # (because key ["topic_25"] is not in for_each map)
  - resource "ibm_event_streams_topic" "es_topic" {
      - config               = {
          - "cleanup.policy"  = "delete"
          - "retention.bytes" = "209715200"
          - "retention.ms"    = "86400000"
          - "segment.bytes"   = "209715200"
        } -> null
      - id                   = "crn:v1:bluemix:public:messagehub:us-south:a/26f737d77ed726547f77e08f865c5a26:4f645eda-a789-4408-a916-f9b25c04b8a3:topic:topic_25" -> null
      - kafka_brokers_sasl   = [
          - "broker-0-kpgqq4h27t2jjby7.kafka.svc11.us-south.eventstreams.cloud.ibm.com:9093",
          - "broker-1-kpgqq4h27t2jjby7.kafka.svc11.us-south.eventstreams.cloud.ibm.com:9093",
          - "broker-2-kpgqq4h27t2jjby7.kafka.svc11.us-south.eventstreams.cloud.ibm.com:9093",
          - "broker-3-kpgqq4h27t2jjby7.kafka.svc11.us-south.eventstreams.cloud.ibm.com:9093",
          - "broker-4-kpgqq4h27t2jjby7.kafka.svc11.us-south.eventstreams.cloud.ibm.com:9093",
          - "broker-5-kpgqq4h27t2jjby7.kafka.svc11.us-south.eventstreams.cloud.ibm.com:9093",
        ] -> null
      - kafka_http_url       = "https://kpgqq4h27t2jjby7.svc11.us-south.eventstreams.cloud.ibm.com" -> null
      - name                 = "topic_25" -> null
      - partitions           = 3 -> null
      - resource_instance_id = "crn:v1:bluemix:public:messagehub:us-south:a/26f737d77ed726547f77e08f865c5a26:4f645eda-a789-4408-a916-f9b25c04b8a3::" -> null
    }

Plan: 0 to add, 0 to change, 1 to destroy.
```

`terraform apply` output:
```
module.event_streams.ibm_event_streams_topic.es_topic["topic_25"]: Destroying... [id=crn:v1:bluemix:public:messagehub:us-south:a/26f737d77ed726547f77e08f865c5a26:4f645eda-a789-4408-a916-f9b25c04b8a3:topic:topic_25]
module.event_streams.ibm_event_streams_topic.es_topic["topic_25"]: Destruction complete after 2s
```